###############################################################################
# Created by write_sdc
# Sun Sep  7 13:41:07 2025
###############################################################################
current_design state_machine
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 50.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {comp_p}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {en_offset_cal}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {en_vcm_sw_o_i}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_z}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {single_ended}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {start}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o_i[10]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o_i[6]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o_i[7]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o_i[8]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o_i[9]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vin_n_sw_on}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vin_p_sw_on}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_data}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {en_comp}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {en_offset_cal_o}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {en_vcm_sw_o}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {offset_cal_cycle}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sample_o}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_dummy_o}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o[10]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o[8]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vcm_o[9]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_n_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_n_o[10]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_n_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_n_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_n_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_n_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_n_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_n_o[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_n_o[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_n_o[8]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_n_o[9]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_p_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_p_o[10]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_p_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_p_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_p_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_p_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_p_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_p_o[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_p_o[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_p_o[8]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vref_z_p_o[9]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_n_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_n_o[10]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_n_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_n_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_n_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_n_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_n_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_n_o[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_n_o[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_n_o[8]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_n_o[9]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_p_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_p_o[10]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_p_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_p_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_p_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_p_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_p_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_p_o[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_p_o[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_p_o[8]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vss_p_o[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {clk_data}]
set_load -pin_load 0.0729 [get_ports {en_comp}]
set_load -pin_load 0.0729 [get_ports {en_offset_cal_o}]
set_load -pin_load 0.0729 [get_ports {en_vcm_sw_o}]
set_load -pin_load 0.0729 [get_ports {offset_cal_cycle}]
set_load -pin_load 0.0729 [get_ports {sample_o}]
set_load -pin_load 0.0729 [get_ports {vcm_dummy_o}]
set_load -pin_load 0.0729 [get_ports {data[5]}]
set_load -pin_load 0.0729 [get_ports {data[4]}]
set_load -pin_load 0.0729 [get_ports {data[3]}]
set_load -pin_load 0.0729 [get_ports {data[2]}]
set_load -pin_load 0.0729 [get_ports {data[1]}]
set_load -pin_load 0.0729 [get_ports {data[0]}]
set_load -pin_load 0.0729 [get_ports {vcm_o[10]}]
set_load -pin_load 0.0729 [get_ports {vcm_o[9]}]
set_load -pin_load 0.0729 [get_ports {vcm_o[8]}]
set_load -pin_load 0.0729 [get_ports {vcm_o[7]}]
set_load -pin_load 0.0729 [get_ports {vcm_o[6]}]
set_load -pin_load 0.0729 [get_ports {vcm_o[5]}]
set_load -pin_load 0.0729 [get_ports {vcm_o[4]}]
set_load -pin_load 0.0729 [get_ports {vcm_o[3]}]
set_load -pin_load 0.0729 [get_ports {vcm_o[2]}]
set_load -pin_load 0.0729 [get_ports {vcm_o[1]}]
set_load -pin_load 0.0729 [get_ports {vcm_o[0]}]
set_load -pin_load 0.0729 [get_ports {vref_z_n_o[10]}]
set_load -pin_load 0.0729 [get_ports {vref_z_n_o[9]}]
set_load -pin_load 0.0729 [get_ports {vref_z_n_o[8]}]
set_load -pin_load 0.0729 [get_ports {vref_z_n_o[7]}]
set_load -pin_load 0.0729 [get_ports {vref_z_n_o[6]}]
set_load -pin_load 0.0729 [get_ports {vref_z_n_o[5]}]
set_load -pin_load 0.0729 [get_ports {vref_z_n_o[4]}]
set_load -pin_load 0.0729 [get_ports {vref_z_n_o[3]}]
set_load -pin_load 0.0729 [get_ports {vref_z_n_o[2]}]
set_load -pin_load 0.0729 [get_ports {vref_z_n_o[1]}]
set_load -pin_load 0.0729 [get_ports {vref_z_n_o[0]}]
set_load -pin_load 0.0729 [get_ports {vref_z_p_o[10]}]
set_load -pin_load 0.0729 [get_ports {vref_z_p_o[9]}]
set_load -pin_load 0.0729 [get_ports {vref_z_p_o[8]}]
set_load -pin_load 0.0729 [get_ports {vref_z_p_o[7]}]
set_load -pin_load 0.0729 [get_ports {vref_z_p_o[6]}]
set_load -pin_load 0.0729 [get_ports {vref_z_p_o[5]}]
set_load -pin_load 0.0729 [get_ports {vref_z_p_o[4]}]
set_load -pin_load 0.0729 [get_ports {vref_z_p_o[3]}]
set_load -pin_load 0.0729 [get_ports {vref_z_p_o[2]}]
set_load -pin_load 0.0729 [get_ports {vref_z_p_o[1]}]
set_load -pin_load 0.0729 [get_ports {vref_z_p_o[0]}]
set_load -pin_load 0.0729 [get_ports {vss_n_o[10]}]
set_load -pin_load 0.0729 [get_ports {vss_n_o[9]}]
set_load -pin_load 0.0729 [get_ports {vss_n_o[8]}]
set_load -pin_load 0.0729 [get_ports {vss_n_o[7]}]
set_load -pin_load 0.0729 [get_ports {vss_n_o[6]}]
set_load -pin_load 0.0729 [get_ports {vss_n_o[5]}]
set_load -pin_load 0.0729 [get_ports {vss_n_o[4]}]
set_load -pin_load 0.0729 [get_ports {vss_n_o[3]}]
set_load -pin_load 0.0729 [get_ports {vss_n_o[2]}]
set_load -pin_load 0.0729 [get_ports {vss_n_o[1]}]
set_load -pin_load 0.0729 [get_ports {vss_n_o[0]}]
set_load -pin_load 0.0729 [get_ports {vss_p_o[10]}]
set_load -pin_load 0.0729 [get_ports {vss_p_o[9]}]
set_load -pin_load 0.0729 [get_ports {vss_p_o[8]}]
set_load -pin_load 0.0729 [get_ports {vss_p_o[7]}]
set_load -pin_load 0.0729 [get_ports {vss_p_o[6]}]
set_load -pin_load 0.0729 [get_ports {vss_p_o[5]}]
set_load -pin_load 0.0729 [get_ports {vss_p_o[4]}]
set_load -pin_load 0.0729 [get_ports {vss_p_o[3]}]
set_load -pin_load 0.0729 [get_ports {vss_p_o[2]}]
set_load -pin_load 0.0729 [get_ports {vss_p_o[1]}]
set_load -pin_load 0.0729 [get_ports {vss_p_o[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {comp_p}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {en_offset_cal}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {en_vcm_sw_o_i}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_z}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {single_ended}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {start}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vin_n_sw_on}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vin_p_sw_on}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vcm_o_i[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vcm_o_i[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vcm_o_i[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vcm_o_i[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vcm_o_i[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vcm_o_i[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vcm_o_i[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vcm_o_i[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vcm_o_i[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vcm_o_i[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vcm_o_i[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 10.0000 [current_design]
